Tobamalau/nrf52840/nRF5_SDK_15.3.0_59ac345/examples/peripheral/i2sTobi/main.c
#include <stdio.h>
#include <stdlib.h>
#include <nrf.h>
#include <string.h>

#include "sdk_config.h"
#include "opus.h"
#include "opusTobi.h"
#include "nrf_delay.h"
#include "app_util_platform.h"
#include "app_error.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
#include "nrf_drv_i2s.h"
#include "nrf_drv_timer.h"
#include "boards.h"
#include "nrfx_uarte.h"
#include "nrf_gpiote.h"
#include "nrf_802154_config.h"
#include "nrf_802154.h"
#include "nrf_drv_twi.h"

//#include "nrf_drv_pwm.h"
//#include "app_timer.h"
//#include "nrf_drv_clock.h"

/*###CONFIG###*/
#define VERBOSE 0
#define TIMER_ENABLE 1
#define I2SHAL 1
#define I2C_EN 1
#define CSMACA 0

#define UARTE_RX_BUFF_SIZE 104//(FRAME_SIZE/3 + 4) //hier erst normal nach Packeten suchen und Byteanzahl ermitteln
#define UARTE_TX_BUFF_SIZE 20
#define GPIOTE_CHANNEL_0 0
/*802.15.4 defines*/
#define MACHEAD         2//9
#define PAYLOAD         UARTE_RX_BUFF_SIZE - OPUSPACKHEAD
#define DESTINATIONPAN  0x1234
#define DESTINATION     0x5678
#define SOURCE          0x0001
#define MAX_MESSAGE_SIZE (MACHEAD + OPUSPACKHEAD + PAYLOAD)
#define IEEECHANNEL        11
#define MAXLOSTPACKETS     5
#define IEEETXPOWER        0

/*16 Bit Counter*/
#define _IEEETRANSFAILED   0
#define _IEEECCAFAILED     1
#define _IEEENOTREADY      2
#define _IEEELOSTPACKET    3
#define _IEEECONINTERRUPT  4
/*32 Bit Counter*/
#define _IEEETRANSMITTED   0
#define _IEEERECIVED       1

#if TIMER_ENABLE
const nrf_drv_timer_t TIMER = NRF_DRV_TIMER_INSTANCE(0);
#endif

volatile bool StopAudio = false;
volatile bool PacketIsLost = false;
uint16_t Counter16[5];
uint32_t Counter32[2];
uint32_t RSSISum = 0;
uint32_t RSSIAverage = 0;

volatile uint8_t PacketNum = 0;  //zu Array zusammenfassen
volatile uint16_t timerCnt = 0;
volatile uint16_t timerTotalCnt = 0;
volatile uint16_t timeIEEEsent = 0;
volatile uint16_t timeNewFrameSeq = 0;
volatile uint16_t timelastI2SLoop = 0;

volatile uint8_t bufferNr = 0;
struct opus OpusInstanz = {NULL, NBBYTES, NULL, {}, {}};
unsigned char rxUarteBuffer[3][UARTE_RX_BUFF_SIZE];
char txBuffer[UARTE_TX_BUFF_SIZE];
char txBuffer2[70];
uint8_t State = 0;
volatile bool UarteInRecive = false;
volatile bool I2sInProgress = false;
volatile bool IEEEReciveActiv = false;
volatile bool I2CAbort = false;
volatile uint8_t ReciveBufferPos = 0;
volatile uint8_t ReciveBufferLoad = 0;
volatile uint8_t DecodeBufferPos = 0;
static volatile bool IEEE802154_tx_in_progress;
static volatile bool IEEE802154_tx_done;
volatile bool IEEEnewFrame = false;
uint8_t opusPackNb = 1;
nrfx_uarte_t m_uart = NRFX_UARTE_INSTANCE(0);

#if I2C_EN
#define TWI_INSTANCE_ID     0
#define TDA7901_ADDR        0b1101010    //0xd4d5,0xd6d7,0xd8d9,0xdadb//0b1101000

//#define TDA7901_SUBADDR    
static const nrf_drv_twi_t m_twi = NRF_DRV_TWI_INSTANCE(TWI_INSTANCE_ID);
static volatile bool m_xfer_done = false;
static uint8_t m_sample;
#endif

void timer_event_handler(nrf_timer_event_t event_type, void* p_context);
void m_uart_callback(nrfx_uarte_event_t const * p_event, void * p_context);
void m_uart_context_callback();
void setMacHead(uint8_t *message);
void stopI2S();
uint8_t uarte_init();
void toggleBuffer(volatile uint8_t *buffer);

#if !I2SHAL
static void i2sdata_handler(nrf_drv_i2s_buffers_t const * p_released, uint32_t status);
#endif

#if I2C_EN
void twi_handler(nrf_drv_twi_evt_t const * p_event, void * p_context)
{
    switch (p_event->type)
    {
        case NRF_DRV_TWI_EVT_DONE:
            if (p_event->xfer_desc.type == NRF_DRV_TWI_XFER_RX)
            {
                printf("Temperature: %d Celsius degrees.", m_sample);
            }
            m_xfer_done = true;
            break;
         case NRF_DRV_TWI_EVT_ADDRESS_NACK:
            break;
        default:
            break;
    }
}
static void read_sensor_data(uint8_t addr)
{
    m_xfer_done = false;
    ret_code_t err_code;   //0xd4d5,0xd6d7,0xd8d9,0xdadb
   //(void) addr;
     
    err_code = nrf_drv_twi_tx(&m_twi, TDA7901_ADDR, &addr, sizeof(addr), false);
    APP_ERROR_CHECK(err_code);
    while (m_xfer_done == false);
    while (nrf_drv_twi_is_busy(&m_twi));

 /*   err_code = nrf_drv_twi_rx(&m_twi, TDA7901_ADDR, &m_sample, sizeof(m_sample));
    APP_ERROR_CHECK(err_code);*/

    err_code = nrf_drv_twi_rx(&m_twi, TDA7901_ADDR, &m_sample, sizeof(m_sample));
    APP_ERROR_CHECK(err_code);
    while (m_xfer_done == false);
    while (nrf_drv_twi_is_busy(&m_twi));
}
void twi_init (void)
{
    ret_code_t err_code;

    const nrf_drv_twi_config_t twi_lm75b_config = {
       .scl                = 27,
       .sda                = 26,
       .frequency          = NRF_DRV_TWI_FREQ_100K,
       .interrupt_priority = APP_IRQ_PRIORITY_HIGH,
       .clear_bus_init     = false
    };

    err_code = nrf_drv_twi_init(&m_twi, &twi_lm75b_config, twi_handler, NULL);
    APP_ERROR_CHECK(err_code);

    nrf_drv_twi_enable(&m_twi);
}
void TDA7901_set_mode(void)
{
   ret_code_t err_code;
   uint8_t reg[2];
   
   reg[0] = 0x02;
   reg[1] = 0b01100010;
   err_code = nrf_drv_twi_tx(&m_twi, TDA7901_ADDR, reg, sizeof(reg), false);
   APP_ERROR_CHECK(err_code);
   while (m_xfer_done == false)
      if(I2CAbort)
         return;
   while (nrf_drv_twi_is_busy(&m_twi));

   read_sensor_data(reg[0]);

   /* Sample frequency, 16 Bit*/
   reg[0] = 0x03;
   reg[1] = 0b01010100;
   err_code = nrf_drv_twi_tx(&m_twi, TDA7901_ADDR, reg, sizeof(reg), false);
   APP_ERROR_CHECK(err_code);
   while (m_xfer_done == false);
   while (nrf_drv_twi_is_busy(&m_twi));

   read_sensor_data(reg[0]);

   /* Volume Control*/
   reg[0] = 0x05;
   reg[1] = 0x7f;
   err_code = nrf_drv_twi_tx(&m_twi, TDA7901_ADDR, reg, sizeof(reg), false);
   APP_ERROR_CHECK(err_code);
   while (m_xfer_done == false);
   while (nrf_drv_twi_is_busy(&m_twi));

   read_sensor_data(reg[0]);

   /* Channel 1 LOAD 5 R*/
   reg[0] = 0x11;
   reg[1] = 0b00010001;
   err_code = nrf_drv_twi_tx(&m_twi, TDA7901_ADDR, reg, sizeof(reg), false);
   APP_ERROR_CHECK(err_code);
   while (m_xfer_done == false);
   while (nrf_drv_twi_is_busy(&m_twi));

   read_sensor_data(reg[0]);

   /* Channel 1 on*/
   reg[0] = 0x04;
   reg[1] = 0b00010101;
   err_code = nrf_drv_twi_tx(&m_twi, TDA7901_ADDR, reg, sizeof(reg), false);
   APP_ERROR_CHECK(err_code);
   while (m_xfer_done == false);
   while (nrf_drv_twi_is_busy(&m_twi));

   read_sensor_data(reg[0]);

   for(int i=0x0c; i<0x26; i++)
   {
      read_sensor_data(i);
   }

   /* Clear fault*/
   reg[0] = 0x21;
   reg[1] = 0b10100000;
   err_code = nrf_drv_twi_tx(&m_twi, TDA7901_ADDR, reg, sizeof(reg), false);
   APP_ERROR_CHECK(err_code);
   while (m_xfer_done == false);
   while (nrf_drv_twi_is_busy(&m_twi));

   read_sensor_data(reg[0]);

   for(int i=0x0c; i<0x26; i++)
   {
      read_sensor_data(i);
   }
#if 0
   ret_code_t err_code;
   uint8_t reg[2];
   /* Sample frequency*/
   reg[0] = 0x03;
   reg[1] = 0b01000000;
   err_code = nrf_drv_twi_tx(&m_twi, TDA7901_ADDR, reg, sizeof(reg), false);
   APP_ERROR_CHECK(err_code);
   while (m_xfer_done == false);
   while (nrf_drv_twi_is_busy(&m_twi));

   read_sensor_data(0x20);
   /* Amplifier on/off*/
   reg[0] = 0x07;
   reg[1] = 0b00000001;
   err_code = nrf_drv_twi_tx(&m_twi, TDA7901_ADDR, reg, sizeof(reg), false);
   if(err_code==NRF_ERROR_DRV_TWI_ERR_ANACK)
   APP_ERROR_CHECK(err_code);
   while (m_xfer_done == false);
   while (nrf_drv_twi_is_busy(&m_twi));

